## **Simple popularity based recommender system**

In [0]:
import pandas as pd
import numpy as np

In [0]:
#Importing data

ratings = pd.read_csv('/content/rating_final.csv')
cuisine = pd.read_csv('/content/chefmozcuisine.csv')

In [20]:
#Exploring dataframes

ratings.head()

  userID  placeID  rating  food_rating  service_rating
0  U1077   135085       2            2               2
1  U1077   135038       2            2               1
2  U1077   132825       2            2               2
3  U1077   135060       1            2               2
4  U1068   135104       1            1               2

In [21]:
cuisine.head()

   placeID        Rcuisine
0   135110         Spanish
1   135109         Italian
2   135107  Latin_American
3   135106         Mexican
4   135105       Fast_Food

In [22]:
ratings['rating'].describe()

count    1161.000000
mean        1.199828
std         0.773282
min         0.000000
25%         1.000000
50%         1.000000
75%         2.000000
max         2.000000
Name: rating, dtype: float64

In [0]:
# Therefore each place is rated between 0 to 2 where 2 is being the highest

In [24]:
#Grouping the ratings based on place and find the place with most ratings

count_of_ratings = pd.DataFrame(ratings.groupby('placeID')['rating'].count())

count_of_ratings.sort_values('rating', ascending=False)

         rating
placeID
135085       36
132825       32
135032       28
135052       25
132834       25
...         ...
132766        3
132717        3
135011        3
132668        3
135016        3

[130 rows x 1 columns]

In [0]:
#Top 5 most rated places


most_rated_places = pd.DataFrame([135085,132825,135032,135052,132834], index=np.arange(5), columns=['placeID'])

In [26]:
#Most popular cuisine

most_popular_cuisine = pd.merge(most_rated_places, cuisine, on='placeID')

most_popular_cuisine

   placeID         Rcuisine
0   135085        Fast_Food
1   132825          Mexican
2   135032        Cafeteria
3   135032     Contemporary
4   135052              Bar
5   135052  Bar_Pub_Brewery
6   132834          Mexican